---
kind: method
id: M:Autodesk.Revit.DB.STLExportOptions.IsValidForGridAspectRatio(System.Double)
source: html/92c9cf78-0020-e71e-359e-66190410f53a.htm
---
# Autodesk.Revit.DB.STLExportOptions.IsValidForGridAspectRatio Method

Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForGridAspectRatio(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for GridAspectRatio, false otherwise.